app/Controllers/AdminController.php

public function user()
{
    $users = $this->userModel->findAll();
---
SELECT *
FROM `user`

public function lesson()
    {
        $lessons = $this->lessonModel->join('course', 'course.id_course = lesson.id_course')
                                     ->orderBy('lesson.order', 'ASC')
                                     ->select('lesson.*, course.judul_course as course_title')
                                     ->findAll();
---
SELECT `lesson`.*, `course`.`judul_course` as `course_title`
FROM `lesson`
JOIN `course` ON `course`.`id_course` = `lesson`.`id_course`
ORDER BY `lesson`.`order` ASC

    public function add_lesson()
{
    $courses = $this->courseModel->findAll();
---
SELECT *
FROM `course`

    public function teacher()
    {
        $teachers = $this->teacherModel->findAll();
---
SELECT *
FROM `teacher`

public function gallery()
{
    $gallery = $this->galleryModel->findAll();
---
SELECT *
FROM `gallery`