app/Controllers/AdminController.php

public function lesson()
{
    $lessons = $this->lessonModel->findAll();
---
SELECT *
FROM `lesson`