app/Controllers/Home.php

    public function index()
    {
        $users = $this->userModel->findAll();
        $teachers = $this->teacherModel->findAll();
        $gallery = $this->galleryModel->findAll(); // Tambahkan baris ini untuk mengambil data galeri
---
SELECT *
FROM `user`
SELECT *
FROM `teacher`
SELECT *
FROM `gallery`

    public function course()
    {
        // Ambil daftar kursus dan data guru untuk dropdown
        $courses = $this->courseModel->select('course.*, teacher.nama as teacher_name')
                                     ->join('teacher', 'teacher.id_teacher = course.id_teacher')
                                     ->findAll();
---
SELECT `course`.*, `teacher`.`nama` as `teacher_name`
FROM `course`
JOIN `teacher` ON `teacher`.`id_teacher` = `course`.`id_teacher`