app/Controllers/Home.php

INSERT INTO `user` (`username`, `email`, `password`, `role`) VALUES ('core', 'core7843@gmail.com', '$2y$10$OcHDUHisluRTtgsY5tB/UOlUKKRCH4/9jRkCW3W7PzU9z8SJYK2ce', 'teacher')
---
        ];

        // Simpan data pengguna
        $this->userModel->insert($userData);