app/Models/CourseModel.php

SELECT *
FROM `teacher`
---
    public function getTeachersForDropdown()
    {
        $teacherModel = new TeacherModel();
        $teachers = $teacherModel->findAll();