app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `username` = 'cobit'
AND `role` = 'user'
 LIMIT 1
---
    public function getUserByRole($username, $role)
    {
        return $this->where('username', $username)
                    ->where('role', $role)
                    ->first();